{
  "token_word2id": {
    "<pad>": 0,
    "<s>": 1,
    "</s>": 2,
    "<unk>": 3,
    "<con>": 4,
    "": 5,
    "(": 6,
    ")": 7,
    ".": 8,
    ";": 9,
    "Or": 10,
    "get": 11,
    "{": 12,
    "}": 13,
    "Subject": 14,
    "=": 15,
    "View": 16,
    "Custom": 17,
    "Builder": 18,
    "<": 19,
    ">": 20,
    "Bar": 21,
    "Scroll": 22,
    ",": 23,
    "public": 24,
    "return": 25,
    "the": 26,
    "\"": 27,
    "pass": 28,
    "if": 29,
    "_": 30,
    "T": 31,
    "@": 32,
    "List": 33,
    "CTL": 34,
    "name": 35,
    "is": 36,
    "Xml": 37,
    "Smart": 38,
    "Tag": 39,
    "Sdt": 40,
    "Box": 41,
    "set": 42,
    "scroll": 43,
    "Interface": 44,
    "String": 45,
    "tab": 46,
    ":": 47,
    "Object": 48,
    "custom": 49,
    "acc": 50,
    "Factory": 51,
    "factory": 52,
    "view": 53,
    "previous": 54,
    "Value": 55,
    "Request": 56,
    "value": 57,
    "method": 58,
    "fqn": 59,
    "Exception": 60,
    "Key": 61,
    "Tab": 62,
    "ktab": 63,
    "[": 64,
    "]": 65,
    "kvno": 66,
    "-": 67,
    "new": 68,
    "Principal": 69,
    "Name": 70,
    "a": 71,
    "null": 72,
    "this": 73,
    "Schemas": 74,
    "?": 75,
    "for": 76,
    "length": 77,
    "0": 78,
    "Component": 79,
    "By": 80,
    "Fqn": 81,
    "throws": 82,
    "Admin": 83,
    "Service": 84,
    "Gets": 85,
    "void": 86,
    "append": 87,
    "create": 88,
    "passwords": 89,
    "1": 90,
    "KRB": 91,
    "NT": 92,
    "==": 93,
    "Array": 94,
    "property": 95,
    "This": 96,
    "extends": 97,
    "about": 98,
    "Extension": 99,
    "creators": 100,
    "should": 101,
    "prefer": 102,
    "link": 103,
    "possible": 104,
    "assert": 105,
    "state": 106,
    "Changed": 107,
    "rubber": 108,
    "Vertical": 109,
    "Horizontal": 110,
    "Schema": 111,
    "static": 112,
    "KDC": 113,
    "names": 114,
    "kdc": 115,
    "!=": 116,
    "Mapping": 117,
    "Method": 118,
    "Dto": 119,
    "Param": 120,
    "Kaa": 121,
    "kaa": 122,
    "schemas": 123,
    "fully": 124,
    "qualified": 125,
    "write": 126,
    "boolean": 127,
    "...": 128,
    "kdcs": 129,
    "IO": 130,
    "Krb": 131,
    "Instance": 132,
    "entries": 133,
    "key": 134,
    "Set": 135,
    "char": 136,
    "int": 137,
    "Character": 138,
    "Digit": 139,
    "'0'": 140,
    "add": 141,
    "Entry": 142,
    "index": 143,
    "Of": 144,
    "'/'": 145,
    "UNKNOWN": 146,
    "SRV": 147,
    "HST": 148,
    "true": 149,
    "save": 150,
    "Writes": 151,
    "or": 152,
    "appends": 153,
    "keys": 154,
    "into": 155,
    "keytab": 156,
    "Acc": 157,
    "of": 158,
    "why": 159,
    "there": 160,
    "not": 161,
    "Deprecated": 162,
    "final": 163,
    "Strategy": 164,
    "About": 165,
    "Change": 166,
    "Event": 167,
    "e": 168,
    "logger": 169,
    "debug": 170,
    "Selected": 171,
    "Rubber": 172,
    "Zoomed": 173,
    "Panel": 174,
    "Mouse": 175,
    "Monitor": 176,
    "called": 177,
    "whenever": 178,
    "selected": 179,
    "in": 180
  },
  "action_word2id": {
    "<pad>": 0,
    "<unk>": 1,
    "equal": 2,
    "insert": 3,
    "replace": 4,
    "delete": 5
  }
}