{
  "code_word2id": {
    "<pad>": 0,
    "<s>": 1,
    "</s>": 2,
    "<unk>": 3,
    "<con>": 4,
    "": 5,
    "(": 6,
    ")": 7,
    ".": 8,
    ";": 9,
    "get": 10,
    "Or": 11,
    "{": 12,
    "}": 13,
    "=": 14,
    "View": 15,
    "Custom": 16,
    "Subject": 17,
    "Builder": 18,
    "<": 19,
    ">": 20,
    "Scroll": 21,
    ",": 22,
    "Bar": 23,
    "public": 24,
    "return": 25,
    "\"": 26,
    "pass": 27,
    "_": 28,
    "T": 29,
    "List": 30,
    "scroll": 31,
    "CTL": 32,
    "String": 33,
    ":": 34,
    "name": 35,
    "if": 36,
    "Object": 37,
    "Xml": 38,
    "Smart": 39,
    "Tag": 40,
    "Sdt": 41,
    "Box": 42,
    "factory": 43,
    "set": 44,
    "previous": 45,
    "Value": 46,
    "@": 47,
    "Interface": 48,
    "Request": 49,
    "fqn": 50,
    "Exception": 51,
    "tab": 52,
    "Key": 53,
    "Tab": 54,
    "ktab": 55,
    "[": 56,
    "]": 57,
    "kvno": 58,
    "-": 59,
    "new": 60,
    "Principal": 61,
    "Name": 62,
    "custom": 63,
    "acc": 64,
    "null": 65,
    "view": 66,
    "this": 67,
    "Schemas": 68,
    "?": 69,
    "length": 70,
    "0": 71,
    "Component": 72,
    "value": 73,
    "By": 74,
    "Fqn": 75,
    "throws": 76,
    "Admin": 77,
    "Service": 78,
    "void": 79,
    "append": 80,
    "create": 81,
    "passwords": 82,
    "1": 83,
    "KRB": 84,
    "NT": 85,
    "==": 86,
    "Array": 87,
    "extends": 88,
    "about": 89,
    "Factory": 90,
    "assert": 91,
    "state": 92,
    "Changed": 93,
    "rubber": 94,
    "Vertical": 95,
    "Horizontal": 96,
    "Schema": 97,
    "static": 98,
    "names": 99,
    "for": 100,
    "kdc": 101,
    "!=": 102,
    "Mapping": 103,
    "method": 104,
    "Method": 105,
    "Dto": 106,
    "Param": 107,
    "Kaa": 108,
    "kaa": 109,
    "write": 110,
    "boolean": 111,
    "KDC": 112,
    "...": 113,
    "kdcs": 114,
    "IO": 115,
    "Krb": 116,
    "Instance": 117,
    "entries": 118,
    "key": 119,
    "Set": 120,
    "char": 121,
    "int": 122,
    "Character": 123,
    "is": 124,
    "Digit": 125,
    "'0'": 126,
    "add": 127,
    "Entry": 128,
    "index": 129,
    "Of": 130,
    "'/'": 131,
    "UNKNOWN": 132,
    "SRV": 133,
    "HST": 134,
    "true": 135,
    "save": 136,
    "Acc": 137,
    "Deprecated": 138,
    "final": 139,
    "Strategy": 140,
    "About": 141,
    "Change": 142,
    "Event": 143,
    "e": 144,
    "logger": 145,
    "debug": 146,
    "Selected": 147,
    "Rubber": 148,
    "Zoomed": 149,
    "Panel": 150,
    "Mouse": 151,
    "Monitor": 152
  },
  "action_word2id": {
    "<pad>": 0,
    "<unk>": 1,
    "equal": 2,
    "insert": 3,
    "replace": 4,
    "delete": 5
  },
  "nl_word2id": {
    "<pad>": 0,
    "<s>": 1,
    "</s>": 2,
    "<unk>": 3,
    "<con>": 4,
    ".": 5,
    "the": 6,
    "Or": 7,
    "is": 8,
    "a": 9,
    "Gets": 10,
    "property": 11,
    "This": 12,
    "method": 13,
    "Extension": 14,
    "creators": 15,
    "should": 16,
    "prefer": 17,
    "{": 18,
    "@": 19,
    "link": 20,
    "Subject": 21,
    "Factory": 22,
    "}": 23,
    "if": 24,
    "possible": 25,
    "Interface": 26,
    "CTL": 27,
    "schemas": 28,
    "fully": 29,
    "qualified": 30,
    "name": 31,
    "Writes": 32,
    "or": 33,
    "appends": 34,
    "keys": 35,
    "into": 36,
    "keytab": 37,
    "value": 38,
    "of": 39,
    "custom": 40,
    "Xml": 41,
    "Smart": 42,
    "Tag": 43,
    "Sdt": 44,
    "acc": 45,
    "Bar": 46,
    "Box": 47,
    "why": 48,
    "there": 49,
    "not": 50,
    "set": 51,
    "for": 52,
    "called": 53,
    "whenever": 54,
    "view": 55,
    "tab": 56,
    "selected": 57,
    "in": 58
  }
}